hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/NEU_ABM_TAM_TAM/ABM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>NEU</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
            </order>
            <message>
                <ABM>
                    <meldungsattribute>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                        <verbindlicherLiefertermin>${requestedCustomerDate}</verbindlicherLiefertermin>
                        <produktpositionen>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt>
                                    <kategorie>TAL</kategorie>
                                    <bezeichner>TAL; CuDA 2 Draht hbr (HVt)</bezeichner>
                                    <uebertragungsVerfahren>H04</uebertragungsVerfahren>
                                </produkt>
                            </position>
                        </produktpositionen>
                        <TAL>
                            <vertragsnummer>${contractId}</vertragsnummer>
                            <leitung>
                                <leitungsbezeichnung>
                                    <leitungsschluesselzahl>52B</leitungsschluesselzahl>
                                    <onkzA>89</onkzA>
                                    <onkzB>4401</onkzB>
                                    <ordnungsnummer>1000000000</ordnungsnummer>
                                </leitungsbezeichnung>
                            </leitung>
                            <schaltangaben>
                                <schaltung>
                                    <UEVT>1PH1</UEVT>
                                    <EVS>01</EVS>
                                    <doppelader>01</doppelader>
                                </schaltung>
                            </schaltangaben>
                        </TAL>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0000</meldungscode>
                            <meldungstext>keine Änderung zum Auftrag</meldungstext>
                            <positionsattribute>
                                <ansprechpartnerTelekom>
                                    <anrede>1</anrede>
                                    <vorname>Steve</vorname>
                                    <nachname>Vollmann</nachname>
                                    <telefonnummer>1682076651</telefonnummer>
                                    <emailadresse>sv@web.de</emailadresse>
                                </ansprechpartnerTelekom>
                            </positionsattribute>
                        </position>
                    </meldungspositionen>
                </ABM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
